{
  "common": {
    "name": "vis-2-widgets-weather-and-heating",
    "version": "0.10.4",
    "news": {
      "0.10.4": {
        "en": "Meteored widget: reload once per hour as an option",
        "de": "Widget Meteored: Einmal pro Stunde als Option neu laden",
        "ru": "Метеоризированный виджет: перезагрузка один раз в час в качестве опции",
        "pt": "Widget Meteored: recarregar uma vez por hora como uma opção",
        "nl": "Meteoor widget: één keer per uur opnieuw laden als optie",
        "fr": "Widget Meteored: recharger une fois par heure en option",
        "it": "Widget meteorologico: ricaricare una volta all'ora come opzione",
        "es": "Widget meteored: reload once per hour as an option",
        "pl": "Meteoryt: przeładować raz na godzinę jako opcja",
        "uk": "Meteored віджет: перезавантаження раз на годину як варіант",
        "zh-cn": "气象部件: 作为选项重新装入一次"
      },
      "0.10.3": {
        "en": "Heating Room widget: some translations\nMeteored widget: make reload of widget possible",
        "de": "Heizraum Widget: einige Übersetzungen\nWidget Meteored: Widget neu laden lassen",
        "ru": "Виджет отопительной комнаты: некоторые переводы\nМетеоризированный виджет: сделать перезагрузку виджета возможной",
        "pt": "Widget de sala de aquecimento: algumas traduções\nWidget Meteored: fazer recarga de widget possível",
        "nl": "Verwarmingskamer widget: enkele vertalingen\nMeteoor widget: herladen van widget mogelijk maken",
        "fr": "Widget de chauffage de chambre: quelques traductions\nWidget Météorisé : rendre possible le rechargement de widget",
        "it": "Widget della stanza di riscaldamento: alcune traduzioni\nWidget Meteored: rendere possibile il ricarica di widget",
        "es": "Cuarto de calefacción widget: algunas traducciones\nWidget meteored: hacer posible la recarga de widget",
        "pl": "Ogrzewanie Widget pokoju: niektóre tłumaczenia\nMeteoryt widget: można przeładować widget",
        "uk": "Опалювальний номер віджет: деякі переклади\nMeteored віджет: зробити перезавантаження віджету можливо",
        "zh-cn": "暖室部件:一些翻译\n气象部件: 使部件可以重新装入"
      },
      "0.10.2": {
        "en": "Heating Room widget: support of more then one thermostat. ATTENTIOM: Please check your configuration!",
        "de": "Heizraum Widget: Unterstützung von mehr als einem Thermostat. ATTENTIOM: Bitte überprüfen Sie Ihre Konfiguration!",
        "ru": "Виджет отопительной комнаты: поддержка более одного термостата. Пожалуйста, проверьте свою конфигурацию!",
        "pt": "Widget de sala de aquecimento: suporte de mais um termostato. ATTENTIOM: Por favor, verifique sua configuração!",
        "nl": "Verwarming Kamer widget: ondersteuning van meer dan één thermostaat. ATTENTIOM: Controleer uw configuratie!",
        "fr": "Widget Chauffage Chambre: support de plus d'un thermostat. Veuillez vérifier votre configuration!",
        "it": "Widget della stanza di riscaldamento: supporto di più allora un termostato. ATTENTIOM: Si prega di controllare la configurazione!",
        "es": "Widget de la sala de calefacción: soporte de más entonces un termostato. ATTENTIOM: Por favor, compruebe su configuración!",
        "pl": "Ogrzewanie widget pokoju: wsparcie więcej niż jeden termostat. UWAGA: Proszę sprawdzić konfigurację!",
        "uk": "Опалювальний номер віджету: підтримка більш ніж одного термостату. УВАГА!",
        "zh-cn": "暖室部件:支持一个以上的自动调温器。 请检查您的配置!"
      },
      "0.10.1": {
        "en": "Heating Room widget: smaller optimizations",
        "de": "Heizraum Widget: kleinere Optimierungen",
        "ru": "Виджет отопительной комнаты: меньшие оптимизации",
        "pt": "Widget de sala de aquecimento: otimizações menores",
        "nl": "Verwarming Ruimte widget: kleinere optimalisaties",
        "fr": "Widget Chambre de Chauffage: optimisations plus petites",
        "it": "Widget della stanza di riscaldamento: ottimizzazioni più piccole",
        "es": "Calefacción widget de la habitación: optimizaciones más pequeñas",
        "pl": "Ogrzewanie Widget pokoju: mniejsze optymalizacje",
        "uk": "Віджет опалювальної кімнати: менші оптимізації",
        "zh-cn": "暖室部件:较小的优化"
      },
      "0.10.0": {
        "en": "widget from Meteored (DasWetter.com) added, no further adapter needed, but only display of data from Meteored possible\nchanges requested by adapter checker\ndependencies updated",
        "de": "widget von Meteored (DasWetter.com) hinzugefügt, kein weiterer Adapter erforderlich, sondern nur Daten von Meteored möglich anzeigen\nänderungen, die von adapter checker angefordert werden\naktualisierte abhängigkeiten",
        "ru": "добавлен виджет от Meteored (DasWetter.com), больше адаптер не нужен, а только отображение данных от Meteored возможно\nизменения, запрошенные adapter checker\nобновленные зависимости",
        "pt": "widget de Meteored (DasWetter.com) adicionado, nenhum adaptador adicional necessário, mas apenas exibição de dados de Meteored possível\nalterações solicitadas pelo verificador do adaptador\ndependências atualizadas",
        "nl": "widget van Meteoored (DasWetter.com) toegevoegd, geen verdere adapter nodig, maar alleen weergave van gegevens van Meteoored mogelijk\nwijzigingen gevraagd door adaptercontrole\nafhankelijkheden bijgewerkt",
        "fr": "widget de Meteored (DasWetter.com) ajouté, aucun autre adaptateur nécessaire, mais uniquement l'affichage des données de Meteored possible\nmodifications demandées par l'adaptateur checker\ndépendances mises à jour",
        "it": "widget di Meteored (DasWetter.com) aggiunto, nessun ulteriore adattatore necessario, ma solo la visualizzazione di dati da Meteored possibile\nmodifiche richieste da adattatore checker\ndipendenze aggiornate",
        "es": "widget de Meteored (DasWetter.com) agregó, ningún adaptador adicional necesario, pero sólo muestra datos de Meteored posible\ncambios solicitados por el adaptador\ndependencias actualizadas",
        "pl": "widget z Meteored (DasWetter.com) dodał, nie potrzebny jest kolejny adapter, ale tylko wyświetlanie danych z Meteored możliwe\nzmiany wymagane przez sprawdzacz adaptera\nzaktualizowane zależności",
        "uk": "віджет від Meteored (DasWetter.com) додано, не потрібно додатково адаптер, але тільки відображення даних з Meteored можливо\nзміни, які вимагаються перевіркою адаптера\nоновлені залежності",
        "zh-cn": "来自Meteored (DasWetter.com) 的部件添加, 不需要更多的适配器, 只显示来自 Meteored 的数据\n适配器检查器要求的更改\n更新依赖关系"
      },
      "0.9.1": {
        "en": "bug fix: support darkmode for time picker",
        "de": "bugfix: unterstützung darkmode für zeitwähler",
        "ru": "фиксация клопов: поддержка темной моды для пикера времени",
        "pt": "correção de bugs: suporte para o darkmode para o picador de tempo",
        "nl": "foutfix: ondersteuning voor de donkere modus voor tijdkiezer",
        "fr": "correction du bug: support darkmode pour le sélectionneur de temps",
        "it": "correzione bug: supporto darkmode per il time picker",
        "es": "corrección de fallos: soporte de movimiento oscuro para el recolector de tiempo",
        "pl": "fix: obsługa trybu darkmode dla pickera czasu",
        "uk": "виправлення помилок: підтримка darkmode для таймера",
        "zh-cn": "错误修正: 支持时间选择器的暗模式"
      },
      "0.9.0": {
        "en": "see issue #66: Heating Time Schedule and Profile Params widget - option to use select box for temperature adjustment like Pittini vis\nsee issue #66: Heating Time Schedule and Profile Paramswidget - option to use time picker for time adjustments",
        "de": "siehe Ausgabe #66: Heizzeitplan und Profil Params Widget - Option, wählen Sie Feld für Temperaturanpassung wie Pittini vis zu verwenden\nsiehe Ausgabe #66: Heizzeitplan und Profil Paramswidget - Möglichkeit Zeitwähler für Zeitanpassungen zu verwenden",
        "ru": "#66: График нагревания и виджет профиля Парамс - возможность использовать поле для регулировки температуры, как Pittini vis\n#66: График нагревания и Парамсвиджет профиля - возможность использования пикера времени для корректировки времени",
        "pt": "veja o número #66: Calendário de Tempo de Aquecimento e widget de parâmetros de perfil - opção para usar a caixa de seleção para ajuste de temperatura como Pittini vis\nveja o número #66: Calendário de Tempo de Aquecimento e Perfil Paramswidget - opção para usar o tempo de coleta para ajustes de tempo",
        "nl": "zie nummer #66: Verwarmingstijd schema en profiel Params widget - optie om select box te gebruiken voor temperatuuraanpassing zoals Pittini vis\nzie nummer #66: Verwarmingstijd schema en profiel Paramswidget - optie om tijdkiezer te gebruiken voor tijdaanpassingen",
        "fr": "voir le numéro 66: Calendrier de chauffage et profil Params widget - option d'utiliser la boîte de sélection pour le réglage de la température comme Pittini vis\nvoir le numéro 66: Horaire du chauffage et profil Paramswidget - option d'utiliser le choix du temps pour les ajustements de temps",
        "it": "vedi numero #66: Heat Time Schedule and Profile Params widget - opzione per utilizzare la casella di selezione per la regolazione della temperatura come Pittini vis\nvedi numero #66: Orari di riscaldamento e profilo Paramswidget - opzione per utilizzare il time picker per le regolazioni di tempo",
        "es": "ver el número #66: Calendario de calentamiento y Perfil Params widget - opción para usar el cuadro selecto para el ajuste de temperatura como Pittini vis\nver número #66: Calendario de tiempo de calefacción y perfil Paramswidget - opción para utilizar el tiempo de selección para ajustes de tiempo",
        "pl": "zobacz numer # 66: Harmonogram ogrzewania i profil Params widget - opcja wyboru pola do regulacji temperatury jak Pittini vis\nzobacz numer # 66: Harmonogram ogrzewania i profil Paramswidget - opcja wyboru czasu na dostosowanie czasu",
        "uk": "див. питання #66: Графік роботи на опалювальному часі та Параметри профілю віджет - варіант використання вибрати коробку для регулювання температури, як Pittini vis\nдив. питання #66: Графік роботи на опалювальному часі та Параmswidget - варіант використання таймера часу для налаштування часу",
        "zh-cn": "参见第66期: 加热时间表和配置参数部件 - 选择使用选择框进行温度调整, 如 Pittini 相对\n参见第66期: 加热时间表和配置 Paramswidget - 选择使用计时器进行时间调整"
      }
    },
    "licenseInformation": {
      "license": "MIT",
      "type": "free"
    },
    "titleLang": {
      "en": "VIS-2 weather and heating widgets",
      "de": "VIS-2 Wetter und Heizung Widgets",
      "ru": "Виджеты погоды и отопления VIS-2",
      "pt": "Widgets de tempo e aquecimento VIS-2",
      "nl": "VIS-2 weers- en verwarmingselementen",
      "fr": "VIS-2 widgets météo et chauffage",
      "it": "VIS-2 widget meteo e riscaldamento",
      "es": "VIS-2 widgets de clima y calefacción",
      "pl": "Witryny pogodowe i grzewcze VIS-2",
      "uk": "VIS-2 погода та опалення віджети",
      "zh-cn": "VIS-2 天气和暖气部件"
    },
    "desc": {
      "en": "VIS-2 weather and heating widgets",
      "de": "VIS-2 Wetter und Heizung Widgets",
      "ru": "Виджеты погоды и отопления VIS-2",
      "pt": "Widgets de tempo e aquecimento VIS-2",
      "nl": "VIS-2 weers- en verwarmingselementen",
      "fr": "VIS-2 widgets météo et chauffage",
      "it": "VIS-2 widget meteo e riscaldamento",
      "es": "VIS-2 widgets de clima y calefacción",
      "pl": "Witryny pogodowe i grzewcze VIS-2",
      "uk": "VIS-2 погода та опалення віджети",
      "zh-cn": "VIS-2 天气和暖气部件"
    },
    "authors": [
      "rg-engineering <info@rg-engineering.eu>"
    ],
    "keywords": [
      "weather"
    ],
    "platform": "Javascript/Node.js",
    "icon": "vis-2-widgets-weather-and-heating.png",
    "extIcon": "https://raw.githubusercontent.com/rg-engineering/ioBroker.vis-2-widgets-weather/master/admin/vis-2-widgets-weather-and-heating.png",
    "enabled": true,
    "readme": "https://github.com/rg-engineering/ioBroker.vis-2-widgets-weather-and-heating/blob/master/README.md",
    "loglevel": "info",
    "mode": "none",
    "adminUI": {
      "config": "none"
    },
    "nogit": true,
    "onlyWWW": true,
    "type": "visualization-widgets",
    "connectionType": "cloud",
    "dataSource": "poll",
    "visWidgets": {
      "vis2WeatherHeatingWidgets": {
        "i18n": "component",
        "name": "vis2WeatherHeatingWidgets",
        "url": "vis-2-widgets-weather-and-heating/customWidgets.js",
        "components": [
          "GeneralEChartWidget",
          "WeatherWidget",
          "WeatherDayWidget",
          "WeatherMeteoredWidget",
          "HeatingTimeScheduleWidget",
          "HeatingGeneralParamsWidget",
          "HeatingRoomWidget",
          "HeatingRoomsOverviewWidget",
          "HeatingRomProfileParamsWidget",
          "HeatingWindowStatusOverviewWidget"
        ]
      }
    },
    "restartAdapters": [
      "vis-2"
    ],
    "tier": 3
  },
  "native": {},
  "objects": [],
  "instanceObjects": []
}
